keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxLmu_bf.h
/** \\brief  Length for Ifx_LMU_MEMCON_Bits.ERRDIS */
#define IFX_LMU_MEMCON_ERRDIS_LEN (1)

/** \\brief  Mask for Ifx_LMU_MEMCON_Bits.ERRDIS */
#define IFX_LMU_MEMCON_ERRDIS_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_MEMCON_Bits.ERRDIS */
#define IFX_LMU_MEMCON_ERRDIS_OFF (9)

/** \\brief  Length for Ifx_LMU_MEMCON_Bits.EWERR */
#define IFX_LMU_MEMCON_EWERR_LEN (1)

/** \\brief  Mask for Ifx_LMU_MEMCON_Bits.EWERR */
#define IFX_LMU_MEMCON_EWERR_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_MEMCON_Bits.EWERR */
#define IFX_LMU_MEMCON_EWERR_OFF (5)

/** \\brief  Length for Ifx_LMU_MEMCON_Bits.INTERR */
#define IFX_LMU_MEMCON_INTERR_LEN (1)

/** \\brief  Mask for Ifx_LMU_MEMCON_Bits.INTERR */
#define IFX_LMU_MEMCON_INTERR_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_MEMCON_Bits.INTERR */
#define IFX_LMU_MEMCON_INTERR_OFF (2)

/** \\brief  Length for Ifx_LMU_MEMCON_Bits.OLDAEN */
#define IFX_LMU_MEMCON_OLDAEN_LEN (1)

/** \\brief  Mask for Ifx_LMU_MEMCON_Bits.OLDAEN */
#define IFX_LMU_MEMCON_OLDAEN_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_MEMCON_Bits.OLDAEN */
#define IFX_LMU_MEMCON_OLDAEN_OFF (0)

/** \\brief  Length for Ifx_LMU_MEMCON_Bits.PMIC */
#define IFX_LMU_MEMCON_PMIC_LEN (1)

/** \\brief  Mask for Ifx_LMU_MEMCON_Bits.PMIC */
#define IFX_LMU_MEMCON_PMIC_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_MEMCON_Bits.PMIC */
#define IFX_LMU_MEMCON_PMIC_OFF (8)

/** \\brief  Length for Ifx_LMU_MEMCON_Bits.POLDAEN */
#define IFX_LMU_MEMCON_POLDAEN_LEN (1)

/** \\brief  Mask for Ifx_LMU_MEMCON_Bits.POLDAEN */
#define IFX_LMU_MEMCON_POLDAEN_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_MEMCON_Bits.POLDAEN */
#define IFX_LMU_MEMCON_POLDAEN_OFF (1)

/** \\brief  Length for Ifx_LMU_MEMCON_Bits.RMWERR */
#define IFX_LMU_MEMCON_RMWERR_LEN (1)

/** \\brief  Mask for Ifx_LMU_MEMCON_Bits.RMWERR */
#define IFX_LMU_MEMCON_RMWERR_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_MEMCON_Bits.RMWERR */
#define IFX_LMU_MEMCON_RMWERR_OFF (4)

/** \\brief  Length for Ifx_LMU_MEMCON_Bits.WSTATES */
#define IFX_LMU_MEMCON_WSTATES_LEN (4)

/** \\brief  Mask for Ifx_LMU_MEMCON_Bits.WSTATES */
#define IFX_LMU_MEMCON_WSTATES_MSK (0xf)

/** \\brief  Offset for Ifx_LMU_MEMCON_Bits.WSTATES */
#define IFX_LMU_MEMCON_WSTATES_OFF (12)

/** \\brief  Length for Ifx_LMU_MODID_Bits.ID_VALUE */
#define IFX_LMU_MODID_ID_VALUE_LEN (32)

/** \\brief  Mask for Ifx_LMU_MODID_Bits.ID_VALUE */
#define IFX_LMU_MODID_ID_VALUE_MSK (0xffffffff)

/** \\brief  Offset for Ifx_LMU_MODID_Bits.ID_VALUE */
#define IFX_LMU_MODID_ID_VALUE_OFF (0)

/** \\brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN0 */
#define IFX_LMU_RGN_ACCENA_EN0_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN0 */
#define IFX_LMU_RGN_ACCENA_EN0_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN0 */
#define IFX_LMU_RGN_ACCENA_EN0_OFF (0)

/** \\brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN10 */
#define IFX_LMU_RGN_ACCENA_EN10_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN10 */
#define IFX_LMU_RGN_ACCENA_EN10_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN10 */
#define IFX_LMU_RGN_ACCENA_EN10_OFF (10)

/** \\brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN11 */
#define IFX_LMU_RGN_ACCENA_EN11_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN11 */
#define IFX_LMU_RGN_ACCENA_EN11_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN11 */
#define IFX_LMU_RGN_ACCENA_EN11_OFF (11)

/** \\brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN12 */
#define IFX_LMU_RGN_ACCENA_EN12_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN12 */
#define IFX_LMU_RGN_ACCENA_EN12_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN12 */
#define IFX_LMU_RGN_ACCENA_EN12_OFF (12)

/** \\brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN13 */
#define IFX_LMU_RGN_ACCENA_EN13_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN13 */
#define IFX_LMU_RGN_ACCENA_EN13_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN13 */
#define IFX_LMU_RGN_ACCENA_EN13_OFF (13)

/** \\brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN14 */
#define IFX_LMU_RGN_ACCENA_EN14_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN14 */
#define IFX_LMU_RGN_ACCENA_EN14_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN14 */
#define IFX_LMU_RGN_ACCENA_EN14_OFF (14)

/** \\brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN15 */
#define IFX_LMU_RGN_ACCENA_EN15_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN15 */
#define IFX_LMU_RGN_ACCENA_EN15_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN15 */
#define IFX_LMU_RGN_ACCENA_EN15_OFF (15)

/** \\brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN16 */
#define IFX_LMU_RGN_ACCENA_EN16_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN16 */
#define IFX_LMU_RGN_ACCENA_EN16_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN16 */
#define IFX_LMU_RGN_ACCENA_EN16_OFF (16)

/** \\brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN17 */
#define IFX_LMU_RGN_ACCENA_EN17_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN17 */
#define IFX_LMU_RGN_ACCENA_EN17_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN17 */
#define IFX_LMU_RGN_ACCENA_EN17_OFF (17)

/** \\brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN18 */
#define IFX_LMU_RGN_ACCENA_EN18_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN18 */
#define IFX_LMU_RGN_ACCENA_EN18_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN18 */
#define IFX_LMU_RGN_ACCENA_EN18_OFF (18)

/** \\brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN19 */
#define IFX_LMU_RGN_ACCENA_EN19_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN19 */
#define IFX_LMU_RGN_ACCENA_EN19_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN19 */
#define IFX_LMU_RGN_ACCENA_EN19_OFF (19)

/** \\brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN1 */
#define IFX_LMU_RGN_ACCENA_EN1_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN1 */
#define IFX_LMU_RGN_ACCENA_EN1_MSK (0x1)

